Repository: nurielmeni/umi-fbf
Catalog: niloos/plugins/NlsHunter/languages/NlsHunter-*.po
Languages: he_il

source: You do not have sufficient permissions to access this page.
he_il: אין לך הרשאות מספיקות כדי לגשת לעמוד זה.

source: Select
he_il: בחר

source: Could not create Model.
he_il: אין אפשרות ליצור מודל.

source: Could not init Card Services.
he_il: אין אפשרות להתחבר לשירותי Card

source: Error: Card Services:
he_il: שגיאה: שירותי כרטיס

source: Could not init Directory Services.
he_il: אין אפשרות להתחבר לשירותי Directory

source: Error: Directory Services:
he_il: שגיאה: שירותי מדריך

source: Could not init Search Services.
he_il: אין אפשרות להתחבר לשירותי Search

source: Error: Search Services:
he_il: שגיאה: שירותי חיפוש

source: Supplier Id
he_il: מזהה ספק

source: Job Code
he_il: קוד משרה

source: Full Name
he_il: שם החבר:

source: Phone
he_il: טלפון

source: Email
he_il: מייל חברה

source: Applicant form data:
he_il: פרטי החבר/ה שלי:

source: CV Applied from Reichman Jobs Fair Site
he_il: קורות חיים נשלחו מאתר יריד משרות רייכמן

source: My friend details:
he_il: פרטי החבר/ה שלי:

source: Cell
he_il: טלפון:

source: Area
he_il: מתגורר ב…

source: What job?
he_il: התפקיד שתפור עליו:

source: Append CV File
he_il: צירוף קורות חיים (רק למשרות מטה)

source: My details:
he_il: הפרטים שלי:

source: My Name
he_il: שמי:

source: Employee ID
he_il: מזהה מעסיק

source: Company email
he_il: אימייל פרטי:

source: * By the terms
he_il: * כפוף לתקנון

source: Company Website:
he_il: אתר החברה:

source: To employer page
he_il: לעמוד המעסיק

source: Employers List
he_il: רשימת מעסיקים

source: Submit Application
he_il: הגשת מועמדות

source: Upload CV
he_il: העלאת קובץ קו”ח

source: Select file
he_il: בחר קובץ

source: Send
he_il: שלח

source: More Details
he_il: לפרטים נוספים

source: Open positions by area
he_il: משרות פתוחות לפי תחום לימוד

source: Select Area
he_il: בחר תחום לימוד

source: Open Positions
he_il: משרות פתוחות

source: Not Found: The requested Job Code was not found.
he_il: לא נמצא: משרה עם קוד המשרה המבוקש, לא נמצאה.

source: All Fair Jobs
he_il: לכל משרות היריד

source: Search By Employer
he_il: חיפוש לפי מעסיק

source: Search
he_il: חיפוש

source: Applied CV from Jobs Site
he_il: קורות חיים נשלחו מאתר משרות

source: Some error occured
he_il: התרחשה שגיאה

source: CV was not submited
he_il: לא נשלחו קורות חיים

source: Back to home page
he_il: חזור לדף הבית

source: Thenk you!
he_il: תודה!

source: The details recieved successfully
he_il: הפרטים נקלטו בהצלחה

source: Back
he_il: חזור

source: Not required
he_il: לא חובה

source: Meni Nurie
he_il: מני נוריאל
